Alicia Sigmon als333@pitt.edu 9/10/2017

In [1]:
import pandas as pd

# Pandas Series Object: 

"An analog of a one-dimensional array with flexible indices"

pd.Series(data, index=index)

index is an optional argument

In [2]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

data values are a numpy array

In [3]:
data.values

array([ 0.25,  0.5 ,  0.75,  1.  ])

In [4]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [6]:
data['b']

0.5

now you can choose the data based on your specified indices - similar to a dictionary

note: the dictionary is sorted by its keys!!

In [7]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

BUT you can perform operations like arrays -- the series is ORDERED unlike a true dictionary

In [8]:
population['California':'Illinois']

California    38332521
Florida       19552860
Illinois      12882135
dtype: int64

Another example of a series, sorted the dictionary by keys

In [9]:
pd.Series({2:'a', 1:'b', 3:'c'})

1    b
2    a
3    c
dtype: object

If you specify the indices outside of the series, only the specified indices appear

In [10]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])

3    c
2    a
dtype: object

# Pandas Data Frame Object:

"An analog of a two-dimensional array with both flexible row indices and flexible column names"

GENERALIZED NUMPY ARRAY

 "The generalization of a two-dimensional NumPy array, where both the rows and columns have a generalized index for accessing the data."

In [11]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
dtype: int64

Uses a dictionary to construct a 2d object containing area and population of the given states:

In [12]:
states = pd.DataFrame({'population': population,
                       'area': area})
states

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

With Data Frames you can access columns in addition to accessing the indices

In [13]:
states.index

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

In [14]:
states.columns

Index(['area', 'population'], dtype='object')

SPECIALIZED DICTIONARY

 - DataFrame maps a column name to a series of column data

In [15]:
states['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [16]:
states['population']

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
Name: population, dtype: int64

Data Frame from a single Series:

In [17]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193

Data Frame from a List: (fills in missing numbers with NaN)

In [18]:
data = [{'a': i, 'b': 2 * i}
        for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [19]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

# Data Camp: Intermediate Python for Data Science

Chapter: Dictionaries, Pandas

 - dictionaries must contain immutable objects as keys
     - cannot be lists (mutable)
 - keys are unique
 - use del() to delete elements
 
 
 - dictionary: indexed by immutable keyes
     - look up unique keys
 - list: indexed by range of numbers
     - order matters

# CSV Document: 

https://catalog.data.gov/dataset/most-popular-baby-names-by-sex-and-mothers-ethnic-group-new-york-city-8c742

In [20]:
import pandas as pd
names = pd.read_csv('Most_Popular_Baby_Names_by_Sex_and_Mother_s_Ethnic_Group__New_York_City.csv',encoding = 'ISO8859')

In [21]:
names.head()

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
0,2011,FEMALE,HISPANIC,ISABELLA,331,1
1,2011,FEMALE,WHITE NON HISPANIC,ESTHER,224,1
2,2011,MALE,ASIAN AND PACIFIC ISLANDER,ETHAN,177,1
3,2011,MALE,BLACK NON HISPANIC,JAYDEN,184,1
4,2011,FEMALE,ASIAN AND PACIFIC ISLANDER,SOPHIA,119,1

In [22]:
names.tail()

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
2884,2014,MALE,BLACK NON HISPANIC,Tristan,52,25
2885,2014,MALE,HISPANIC,Joseph,114,25
2886,2014,FEMALE,WHITE NON HISPANIC,Grace,86,25
2887,2014,MALE,ASIAN AND PACIFIC ISLANDER,Vincent,46,25
2888,2014,MALE,WHITE NON HISPANIC,Isaac,125,25

In [23]:
names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2889 entries, 0 to 2888
Data columns (total 6 columns):
Year of Birth         2889 non-null int64
Gender                2889 non-null object
Ethnicity             2889 non-null object
Child's First Name    2889 non-null object
Count                 2889 non-null int64
Rank                  2889 non-null int64
dtypes: int64(3), object(3)
memory usage: 135.5+ KB

In [24]:
names.describe()

       Year of Birth        Count         Rank
count    2889.000000  2889.000000  2889.000000
mean     2012.108342   102.181031    14.397023
std         1.179976    69.357345     7.258046
min      2011.000000    23.000000     1.000000
25%      2011.000000    44.000000     8.000000
50%      2012.000000    85.000000    15.000000
75%      2013.000000   141.000000    21.000000
max      2014.000000   426.000000    25.000000

# To Do #4
 - ASL Background

In [25]:
import pandas as pd
grades = pd.read_csv('asl-background-cut_margaret.csv',encoding='ISO8859')

In [26]:
grades.head()

      NAME       YEAR  LEVEL GRADE  MIDTERM  FINAL
0  Madison  Sophomore      1     A       90     95
1      Amy  Sophomore      1    B-       83     79
2     Sean  Sophomore      3     B       82     90
3     Adam   Freshman      1     A       97     91
4   Harper  Sophomore      3    B+       79     94

In [27]:
grades.tail()

       NAME       YEAR  LEVEL GRADE  MIDTERM  FINAL
31    Emily  Sophomore      3     B       81     89
32    Sandy   Freshman      1    B-       82     79
33       Mo   Freshman      1     B       78     89
34  Caitlyn     Senior      5    A-       90     92
35    Kevin     Senior      5     A       95     96

In [28]:
grades.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 6 columns):
NAME       36 non-null object
YEAR       36 non-null object
LEVEL      36 non-null int64
GRADE      36 non-null object
MIDTERM    36 non-null int64
FINAL      36 non-null int64
dtypes: int64(3), object(3)
memory usage: 1.8+ KB

In [29]:
grades.describe()

           LEVEL    MIDTERM      FINAL
count  36.000000  36.000000  36.000000
mean    2.444444  83.333333  89.555556
std     1.557369   8.342661   5.704356
min     1.000000  63.000000  79.000000
25%     1.000000  78.750000  86.000000
50%     3.000000  84.500000  89.500000
75%     3.000000  89.000000  94.250000
max     5.000000  97.000000  99.000000

In [30]:
# Remove Year and Level:

grades_2 = grades[['NAME','GRADE','MIDTERM','FINAL']]
grades_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 4 columns):
NAME       36 non-null object
GRADE      36 non-null object
MIDTERM    36 non-null int64
FINAL      36 non-null int64
dtypes: int64(2), object(2)
memory usage: 1.2+ KB

In [31]:
# Output data only on the midterms
grades[['MIDTERM']].describe()

         MIDTERM
count  36.000000
mean   83.333333
std     8.342661
min    63.000000
25%    78.750000
50%    84.500000
75%    89.000000
max    97.000000

In [32]:
type(grades)

pandas.core.frame.DataFrame

In [33]:
# Suppose you started out with 2 Data Frames: 
    # one with the Names, Grades, Midterms, and Finals, and the other with the students' Year and Level
    # combine these Data Frames
# grades_2 <-- already removed the Year and Level
year_level = grades[['YEAR','LEVEL']]

# Why does the hand book use the command display() ? It does not work herer
    # Also, using axis='col' gave an error
#print('grades_2','year_level\n',pd.concat([grades_2,year_level],axis=1))

pd.concat([grades_2,year_level],axis=1)

#grades_2.head()
#year_level.head()

         NAME GRADE  MIDTERM  FINAL       YEAR  LEVEL
0     Madison     A       90     95  Sophomore      1
1         Amy    B-       83     79  Sophomore      1
2        Sean     B       82     90  Sophomore      3
3        Adam     A       97     91   Freshman      1
4      Harper    B+       79     94  Sophomore      3
5       David     A       89     96     Junior      3
6       Signe    B+       92     83   Freshman      1
7       Sarah    C+       73     81     Senior      5
8   Elizabeth     A       89     97  Sophomore      1
9     Dominic     B       78     87   Freshman      1
10     Justin     B       84     86     Junior      3
11        Ann     A       87     98     Senior      5
12    Cecelia     A       88     99     Senior      5
13      Shane     B       77     89     Junior      3
14     Amanda    B+       84     91     Senior      1
15      Chris     A       89     97     Senior      5
16      Devin    C-       63     79   Sophmore      3
17      Stacy    C+       69     82     Junior      3
18    Antoine     A       89     95  Sophomore      1
19      Louis    A-       91     92   Freshman      1
20       Leah     B       84     86   Freshman      1
21       Ryan    B+       85     89   Freshman      1
22       Mark     B       80     91     Senior      5
23     Summer     A       91     96   Freshman      1
24      Jared     B       87     84   Freshman      1
25    Charles    C+       64     89     Junior      3
26      Hayli    B-       78     84  Sophomore      3
27     Hannah    B+       88     87  Sophomore      3
28     Skylar    A-       89     93   Freshman      1
29     Claire     C       66     86  Sophomore      1
30    Matthew    A-       89     93     Senior      3
31      Emily     B       81     89  Sophomore      3
32      Sandy    B-       82     79   Freshman      1
33         Mo     B       78     89   Freshman      1
34    Caitlyn    A-       90     92     Senior      5
35      Kevin     A       95     96     Senior      5

In [34]:
# You could then Reorder the concatenated version to get back to the original
grades_combo = pd.concat([grades_2,year_level],axis=1)
grades_combo= grades_combo[['NAME','YEAR','LEVEL','GRADE','MIDTERM','FINAL']]

# Are they the same? (YES!)
#grades == grades_combo
grades.head() == grades_combo.head()

# I did .head() so it wasn't a large output

   NAME  YEAR  LEVEL  GRADE  MIDTERM  FINAL
0  True  True   True   True     True   True
1  True  True   True   True     True   True
2  True  True   True   True     True   True
3  True  True   True   True     True   True
4  True  True   True   True     True   True

- You could also do .append() or .extend(), but if you plan to do more than 1,
it is more effective to do DataFrame and then concat()

In [35]:
# series
# makes a series of the first row
grades_series = pd.Series(grades.loc[0]) 
grades_series

NAME         Madison
YEAR       Sophomore
LEVEL              1
GRADE              A
MIDTERM           90
FINAL             95
Name: 0, dtype: object

In [36]:
# Test out the commands from the beginning on this row of Grades data

grades_series.values
grades_series.index
grades_series['NAME']

'Madison'

In [37]:
# indexing

# These are the same indexing
grades_series["MIDTERM":"FINAL"]
grades_series[-2:]

MIDTERM    90
FINAL      95
Name: 0, dtype: object

# To Do 5